jorgebucaran/fisher
jethrokuan/z
petertriho/plugin-bang-bang
PatrickF1/fzf.fish
lwolfsonkin/fish-jupyter-completions
jorgebucaran/getopts.fish
oh-my-fish/plugin-thefuck
edc/bass
jhillyerd/plugin-git
